from flask import Blueprint, render_template, session, url_for

shop_bp = Blueprint('shop', __name__)

mock_categories = [
    "Салфетки SMART ",
    "Швабры SMART ",
    "Щетки ",
    "Коврики грязезащитные ",
    "Коврики защитные ",
    "Банная линия ",
    "Косметическая линия ",
    "Арома средства ",
    "Чистящие средства ",
    "Кухонные аксессуары ",
    "Овощерезки и терки ",
    "Все для карвинга ",
    "Силиконовые изделия ",
    "Товары для выпечки ",
    "Формы для выпечки ",
    "Формы для конфет ",
    "Формы для льда ",
    "Инструменты кухонные ",
    "Ножи кухонные ",
    "Инвентарь подвесной ",
    "Сковороды и кастрюли ",
    "Бытовая техника ",
]

@shop_bp.route("/")
def index():
    return render_template('shop/index.html', cats=mock_categories)
